#+title: A Lidar and Radar Meteorology Science Gateway for Education and Research on the NSF Jetstream2 Cloud

#+bibliography: gateways2024.bib

#+author: Julien Chastang

#+options: toc:nil num:t date:nil author:nil auto-id:t

#+latex_class: IEEEtran
#+latex_class_options: [conference]
#+latex_header: \IEEEoverridecommandlockouts
#+latex_header: \hypersetup{hidelinks}
#+latex_header: \usepackage{cite}
#+latex_header: \usepackage{amsmath,amssymb,amsfonts}
#+latex_header: \usepackage{algorithmic}
#+latex_header: \usepackage{graphicx}
#+latex_header: \usepackage{textcomp}
#+latex_header: \usepackage{xcolor}

* 

#+begin_export latex
\title{A Lidar and Radar Meteorology Science Gateway for Education and Research on the NSF Jetstream2 Cloud}
#+end_export

#+BEGIN_SRC emacs-lisp :var data=authors-table :exports results :results replace latex
  (setq result-string "\\author{")

  (mapc
   (lambda (row)
     (setq result-string
           (concat result-string
                   (format "\\IEEEauthorblockN{%s\\textsuperscript{%s} %s %s}\n\\IEEEauthorblockA{\\textit{%s} \\\\\n\\textit{%s}\\\\\n%s, %s \\\\\n%s}\n\\and\n"
                           (nth 0 row) (nth 1 row) (nth 2 row) (nth 3 row)
                           (nth 4 row) (nth 5 row) (nth 6 row) (nth 7 row) (nth 8 row)))))
   data)

  ;; Remove the last "\and" from the string
  (setq result-string (substring result-string 0 (- (length result-string) 6)))

  (concat result-string "\n}")
#+END_SRC

#+RESULTS:
#+begin_export latex
\author{\IEEEauthorblockN{1\textsuperscript{st} Jennifer DeHart}
\IEEEauthorblockA{\textit{Department of Atmospheric Science} \\
\textit{Colorado State University}\\
Fort Collins, CO USA \\
https://orcid.org/0000-0001-8536-4927}
\and
\IEEEauthorblockN{2\textsuperscript{nd} Brenda Javornik}
\IEEEauthorblockA{\textit{Earth Observing Laboratory} \\
\textit{NSF NCAR, UCAR}\\
Boulder, CO USA \\
brenda@ucar.edu}
\and
\IEEEauthorblockN{3\textsuperscript{rd} Julien Chastang}
\IEEEauthorblockA{\textit{NSF Unidata Program Center} \\
\textit{UCP, UCAR}\\
Boulder, CO USA \\
https://orcid.org/0000-0003-2482-3565}
\and
\IEEEauthorblockN{4\textsuperscript{th} Ana Espinoza}
\IEEEauthorblockA{\textit{NSF Unidata Program Center} \\
\textit{UCP, UCAR}\\
Boulder, CO USA \\
https://orcid.org/0000-0002-6292-073X}
\and
\IEEEauthorblockN{5\textsuperscript{th} Michael Dixon}
\IEEEauthorblockA{\textit{Earth Observing Laboratory} \\
\textit{NSF NCAR, UCAR}\\
Boulder, CO USA \\
https://orcid.org/0000-0002-9597-9113}
\and
\IEEEauthorblockN{6\textsuperscript{th} Michael Bell}
\IEEEauthorblockA{\textit{Department of Atmospheric Science} \\
\textit{Colorado State University}\\
Fort Collins, CO USA \\
https://orcid.org/0000-0002-0496-331X}
}
#+end_export

#+begin_export latex
\maketitle
#+end_export

#+name: abstract
#+BEGIN_SRC org :exports none
This paper introduces a lidar and radar meteorology science gateway deployed on the NSF Jetstream2 cloud, designed to enhance educational and research activities in atmospheric science. Utilizing the "Zero to JupyterHub with Kubernetes" workflow, we have created a science gateway that integrates lidar and radar meteorology software packages, notably the Lidar Radar Open Software Environment (LROSE). This integration allows users to execute applications directly from the JupyterLab terminal, streamlining the creation of datasets for further analysis and visualization within Jupyter notebooks. By combining traditional command-line operations with modern Python-based tools for data analysis and visualization, this gateway provides a robust end-to-end solution that caters to both educational and research needs. The gateway has already been vital in facilitating LROSE instructional workshops and will see future enhancements such as GPU acceleration to boost performance. Our work demonstrates the significant potential of merging established scientific computing techniques with advanced Python environments, opening new avenues for computational science education and research.
#+END_SRC

#+BEGIN_SRC emacs-lisp :var text=abstract :exports none :results replace raw
(format "#+latex: \\begin{abstract}\n%s\n#+latex: \\end{abstract}" text)
#+END_SRC

#+RESULTS:
#+latex: \begin{abstract}
This paper introduces a lidar and radar meteorology science gateway deployed on the NSF Jetstream2 cloud, designed to enhance educational and research activities in atmospheric science. Utilizing the "Zero to JupyterHub with Kubernetes" workflow, we have created a science gateway that integrates lidar and radar meteorology software packages, notably the Lidar Radar Open Software Environment (LROSE). This integration allows users to execute applications directly from the JupyterLab terminal, streamlining the creation of datasets for further analysis and visualization within Jupyter notebooks. By combining traditional command-line operations with modern Python-based tools for data analysis and visualization, this gateway provides a robust end-to-end solution that caters to both educational and research needs. The gateway has already been vital in facilitating LROSE instructional workshops and will see future enhancements such as GPU acceleration to boost performance. Our work demonstrates the significant potential of merging established scientific computing techniques with advanced Python environments, opening new avenues for computational science education and research.
#+latex: \end{abstract}

#+name: keywords
#+BEGIN_SRC org :exports none
LROSE, Cloud-based Science Gateway, Radar Meteorology, Lidar Meteorology, Data Visualization, Educational Technology in Atmospheric Science, JupyterHub, NSF Jetstream2, Atmospheric Data Analysis
#+END_SRC

#+BEGIN_SRC emacs-lisp :var text=keywords :exports none :results replace raw
(format "#+latex: \\begin{IEEEkeywords}\n%s\n#+latex: \\end{IEEEkeywords}" text)
#+END_SRC

#+RESULTS:
#+latex: \begin{IEEEkeywords}
LROSE, Cloud-based Science Gateway, Radar Meteorology, Lidar Meteorology, Data Visualization, Educational Technology in Atmospheric Science, JupyterHub, NSF Jetstream2, Atmospheric Data Analysis
#+latex: \end{IEEEkeywords}

